tap "nikitabobko/tap"
# Pack, ship and run any application as a lightweight container
brew "docker"
# .NET Core
brew "dotnet"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Web browser
cask "firefox"
cask "font-comic-shanns-mono-nerd-font"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Visual client for Helix Core
cask "p4v"
# Desktop client for Proton Pass
cask "proton-pass"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
