tap "hashicorp/tap"
tap "nikitabobko/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Official Amazon AWS command-line interface
brew "awscli"
# Pack, ship and run any application as a lightweight container
brew "docker"
# .NET Core
brew "dotnet"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Web browser
cask "firefox"
cask "font-comic-shanns-mono-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Use it to gain instant access to operations and complete control over the system
cask "p4"
# Visual client for Helix Core
cask "p4v"
# Desktop client for Proton Pass
cask "proton-pass"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Connect to Windows
cask "windows-app"
